In [63]:
import pandas as pd

## Читаем json файл

In [64]:
df = pd.read_json('..\\data\\auto.json', orient='records')
df.set_index(['CarNumber'], inplace = True)
df.head()

              Refund   Fines    Make  Model
CarNumber
Y163O8161RUS       2  3200.0    Ford  Focus
E432XX77RUS        1  6500.0  Toyota  Camry
7184TT36RUS        1  2100.0    Ford  Focus
X582HE161RUS       2  2000.0    Ford  Focus
92918M178RUS       1  5700.0    Ford  Focus

## Сравнительные работы

In [65]:
df[df['Fines'] > 2100]

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
E432XX77RUS        1   6500.000000      Toyota    Camry
92918M178RUS       1   5700.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
E40577152RUS       1   8594.586466        Ford    Focus
...              ...           ...         ...      ...
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
O22097197RUS       1  24300.000000        Ford    Focus
M0309X197RUS       1  22300.000000        Ford    Focus
H419XE197RUS       2   8594.586466      Toyota  Corolla

[455 rows x 4 columns]

In [66]:
df[(df['Fines'] > 2100) & (df['Refund'] == 2)]

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
707987163RUS       2   2200.000000        Ford    Focus
K330T8197RUS       2   8200.000000       Skoda  Octavia
M592CH197RUS       2   8594.586466       Skoda  Octavia
...              ...           ...         ...      ...
O136HO197RUS       2   7800.000000      Toyota  Corolla
O68897197RUS       2  12300.000000        Ford    Focus
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
H419XE197RUS       2   8594.586466      Toyota  Corolla

[309 rows x 4 columns]

In [67]:
df[df['Model'].isin(['Focus', 'Corolla'])]

              Refund         Fines    Make    Model
CarNumber
Y163O8161RUS       2   3200.000000    Ford    Focus
7184TT36RUS        1   2100.000000    Ford    Focus
X582HE161RUS       2   2000.000000    Ford    Focus
92918M178RUS       1   5700.000000    Ford    Focus
H234YH197RUS       2   6000.000000    Ford    Focus
...              ...           ...     ...      ...
Y163O8161RUS       2   1600.000000    Ford    Focus
M0309X197RUS       1  22300.000000    Ford    Focus
O673E8197RUS       2    600.000000    Ford    Focus
8610T8154RUS       1   2000.000000    Ford    Focus
H419XE197RUS       2   8594.586466  Toyota  Corolla

[593 rows x 4 columns]

In [68]:
idx = df.query("CarNumber in ['Y7689C197RUS', '92928M178RUS', '7788KT197RUS', 'H115YO163RUS', 'X758HY197RUS']")
idx

              Refund          Fines  Make  Model
CarNumber
92928M178RUS       1    8594.586466  Ford  Focus
H115YO163RUS       1    2200.000000  Ford  Focus
7788KT197RUS       2   12000.000000  Ford  Focus
X758HY197RUS       2   24200.000000  Ford  Focus
X758HY197RUS       2   72600.000000  Ford  Focus
Y7689C197RUS       1   27000.000000  Ford  Focus
92928M178RUS       1     600.000000  Ford  Focus
H115YO163RUS       1    8594.586466  Ford  Focus
H115YO163RUS       2    1100.000000  Ford  Focus
7788KT197RUS       2    8594.586466  Ford  Focus
7788KT197RUS       1   20000.000000  Ford  Focus
X758HY197RUS       2  145200.000000  Ford  Focus
92928M178RUS       1    1200.000000  Ford  Focus
Y7689C197RUS       2    9000.000000  Ford  Focus
Y7689C197RUS       2   45000.000000  Ford  Focus
7788KT197RUS       2    4000.000000  Ford  Focus
Y7689C197RUS       1   36000.000000  Ford  Focus
92928M178RUS       2    3000.000000  Ford  Focus

## Группировки

In [69]:
df.groupby(['Make']).agg({'Fines' : ['median']})

             Fines
            median
Make
Audi        4200.0
BMW         6500.0
Ford        3500.0
Skoda       3250.0
Toyota      7700.0
Volkswagen  4300.0
Volvo       8500.0

In [70]:
df.groupby(['Make', 'Model']).agg({'Fines' : ['median']})

                     Fines
                    median
Make       Model
Ford       Focus    3500.0
           Mondeo   7650.0
Skoda      Octavia  3250.0
Toyota     Camry    7700.0
           Corolla  7700.0
Volkswagen Golf     4800.0
           Jetta    2800.0
           Passat   3500.0
           Touareg  5800.0

In [71]:
df.groupby(['Make', 'Model']).agg({'Fines' : ['count']})

                   Fines
                   count
Make       Model
Ford       Focus     575
           Mondeo      6
Skoda      Octavia    48
Toyota     Camry      16
           Corolla    18
Volkswagen Golf       20
           Jetta       6
           Passat     22
           Touareg     5

In [72]:
df.groupby(['Make', 'Model']).agg({'Fines' : ['min']})

                     Fines
                       min
Make       Model
Ford       Focus     100.0
           Mondeo   1100.0
Skoda      Octavia   300.0
Toyota     Camry     500.0
           Corolla   900.0
Volkswagen Golf      200.0
           Jetta     500.0
           Passat    100.0
           Touareg   500.0

In [73]:
df.groupby(['Make', 'Model']).agg({'Fines' : ['max']})

                            Fines
                              max
Make       Model
Ford       Focus    180000.000000
           Mondeo    46200.000000
Skoda      Octavia  145000.000000
Toyota     Camry     22400.000000
           Corolla   34300.000000
Volkswagen Golf     168000.000000
           Jetta     46000.000000
           Passat    29700.000000
           Touareg    8594.586466

In [74]:
df.groupby(['Make', 'Model']).agg({'Fines' : ['std']})

                           Fines
                             std
Make       Model
Ford       Focus    15041.269437
           Mondeo   18987.329108
Skoda      Octavia  24339.742174
Toyota     Camry     6410.250654
           Corolla   9629.325617
Volkswagen Golf     36950.839950
           Jetta    17743.026799
           Passat    6969.739135
           Touareg   3461.778173

## Группировки с номерами машин

In [75]:
df1 = df.groupby(['CarNumber']).agg({'Fines' : ['count']})
df1.columns = df1.columns.droplevel(1)
df1.rename(columns={df1.columns[0]:"Number_of_Fines"}, inplace=True)
df1.sort_values(by='Number_of_Fines', ascending=False, inplace=True)
df1.head()

              Number_of_Fines
CarNumber
Y7689C197RUS                4
92928M178RUS                4
7788KT197RUS                4
H115YO163RUS                3
X758HY197RUS                3

## top1

In [76]:
idx = df.query("CarNumber == 'Y7689C197RUS'")
print(idx)

              Refund    Fines  Make  Model
CarNumber
Y7689C197RUS       1  27000.0  Ford  Focus
Y7689C197RUS       2   9000.0  Ford  Focus
Y7689C197RUS       2  45000.0  Ford  Focus
Y7689C197RUS       1  36000.0  Ford  Focus

In [77]:
df1 = df.groupby(['CarNumber']).agg({'Fines' : ['sum']})
df1.columns = df1.columns.droplevel(1)
df1.rename(columns={df1.columns[0]:"Sum_of_Fines"}, inplace=True)
df1.sort_values(by='Sum_of_Fines', ascending=False, inplace=True)
df1.head()

              Sum_of_Fines
CarNumber
X758HY197RUS      242000.0
9020YC197RUS      217500.0
M0279X197RUS      216000.0
Y352O8197RUS      207200.0
Y778EE197RUS      192000.0

## top1

In [78]:
idx = df.query("CarNumber == 'X758HY197RUS'")
print(idx)

              Refund     Fines  Make  Model
CarNumber
X758HY197RUS       2   24200.0  Ford  Focus
X758HY197RUS       2   72600.0  Ford  Focus
X758HY197RUS       2  145200.0  Ford  Focus

In [79]:
# df['Model'][1] = 'OOO'
# df

## Есть ли другие марки у одного номера

In [80]:
df1 = df.groupby(['CarNumber', 'Model']).count()
df1.reset_index(level='Model', inplace = True)
df1 = df1.groupby(['CarNumber']).agg({'Model' : ['count']})
df1.columns = df1.columns.droplevel(1)
df1.rename(columns={df1.columns[0]:"Count_of_Models"}, inplace=True)
df1.sort_values(by='Count_of_Models', ascending=False, inplace=True)
df1

              Count_of_Models
CarNumber
704687163RUS                1
O752MX161RUS                1
O718MM163RUS                1
O6939X163RUS                1
O68897197RUS                1
...                       ...
9975CC77RUS                 1
9943OH154RUS                1
9943KK197RUS                1
9942KK197RUS                1
Y973O8197RUS                1

[524 rows x 1 columns]